export default {
  install: ({ config }) => {
    config.globalProperties.$cities = [
      { id: "cairo", value: "القاهرة" },
      { id: "giza", value: "الجيزة" },
      { id: "alexandria", value: "الأسكندرية" },
      { id: "dakahlia", value: "الدقهلية" },
      { id: "red-sea", value: "البحر الأحمر" },
      { id: "beheira", value: "البحيرة" },
      { id: "fayoum", value: "الفيوم" },
      { id: "gharbiya", value: "الغربية" },
      { id: "ismailia", value: "الإسماعلية" },
      { id: "menofia", value: "المنوفية" },
      { id: "minya", value: "المنيا" },
      { id: "qaliubiya", value: "القليوبية" },
      { id: "new-valley", value: "الوادي الجديد" },
      { id: "suez", value: "السويس" },
      { id: "aswan", value: "اسوان" },
      { id: "assiut", value: "اسيوط" },
      { id: "beni-suef", value: "بني سويف" },
      { id: "port-said", value: "بورسعيد" },
      { id: "damietta", value: "دمياط" },
      { id: "sharkia", value: "الشرقية" },
      { id: "south-sinai", value: "جنوب سيناء" },
      { id: "kafr-al-sheikh", value: "كفر الشيخ" },
      { id: "matrouh", value: "مطروح" },
      { id: "luxor", value: "الأقصر" },
      { id: "qena", value: "قنا" },
      { id: "nort-sinai", value: "شمال سيناء" },
      { id: "sohag", value: "سوهاج" },
    ];
    config.globalProperties.$specialization = [
      { id: "dental", value: "طب الأسنان" },
      { id: "dental-x-ray", value: "طب الأسنان والأشعة" },
      { id: "dermatology", value: "الجلدية" },
      { id: "endoscopy", value: "المناظير" },
      { id: "laboratory", value: "المختبرات" },
      { id: "ent", value: "الأنف واذن والحنجرة" },
      { id: "or", value: "or قسم العمليات" },
      { id: "physiotherapy", value: "العلاج الطبيعى" },
      { id: "radiology", value: "الأشعة" },
      { id: "sterilization-cssd", value: "قسم تعقيم" },
      { id: "sterilization-endoscopy", value: "التعقيم - المناظير" },
      { id: "sterilization-lab", value: "قسم التعقيم المختبرات" },
    ];
    config.globalProperties.$paymentGateways = [
      {
        label: "تحويل بنكى",
        value: "bank_transfer",
        account_number: "059100102436",
        account_name: "المبرمجون العرب لتقنية المعلومات والتسويق العقارى",
        account_iban: "EG690046000600000059100102436",
        swift_code: "MSHQEGCA",
      },
    ];
    config.globalProperties.$contactInfo = {
      tel: "+201103992229",
      whatsapp: "201103992229",
      email: "info@medtich-eg.com",
    };

    config.globalProperties.$searchInStore = (array, val) => {
      let new_object = false;
      if (array) {
        array.find((item) => {
          if (item.id == val) {
            new_object = item.id == val ? item : false;
          }
        });
      }
      return new_object;
    };
    config.globalProperties.$privacy =
      '<h4><strong>منصة ميدتيك لصيانة الاجهزة والمعدات الطبية </strong></h4> <p>هي وحدة اعمال تابعة لشركة المبرمجون العرب لتقنية المعلومات سجل تجاري رقم 435280 ورقم تسجيل ضريبي 888-542-693 و تهدف منصة وتطبيق ميدتيك لتحقيق عمل امن يضمن حقوق كلا من متلقوا الخدمات ومقدمي الخدمات كما تهدف المنصة للوصول الى اكثر مقدمي الخدمات كفاءة وخبرة وتوصيل اعمالهم لمتلقوا الخدمات</p> <h5><strong><u>البند الاول ( التعريفات )</u></strong></h5> <ol> <li>متلقي الخدمة : هو كل من يرغب في الحصول على خدمة دعم فني وصيانة وتغير قطع الغيار الخاصة بالمعدات الطبية سواء كانوا اشخاص طبيعيين او اشخاص اعتباريين مثل المستشفيات والمعامل ومراكز الاشعة ...... الخ</li> <li>مقدم الخدمة : هو كل شخص يري في نفسة الخبرة ويكون لدية سابقة اعمال وحائز على شهادات علمية في مجال الصيانة للمعدات والاجهزة الطبية مثل مهندسين وفنين صيانة الاجهزة الطبية سواء كانوا خريجي الجامعات او المعاهد المؤهلة لهذا التخصص او الحاصلين على دوات تدريبية معتمدة للعمل بهذا التخصص</li> <li>ميدتيك : وهي منصة وتطبيق وسيط بين مقدمي ومتلقوا الخدمة</li> </ol> <h5><strong><u>البند الثاني&nbsp; ( صحة البيانات والمعلومات )</u></strong></h5> <p>يلتزم متلقي ومقدم الخدمة بصحة وسلامة البيانات والمعلومات التي سجلوا من خلالها في التطبيق وانهم دون غيرهم مسئولين عن صحة البيانات المقدمة من خلالهم يقوم بإضافتها.</p> <h5><strong><u>البند الثالث ( مؤهلات وخبرات مقدم الخدمة )</u></strong></h5> <p>يتعهد مقدم الخدمة انه مؤهل للعمل على المشروع وطلبات متلقى الخدمة بما له من تأهيل علمي وعملي وبذلة العناية المهنية اللازمة</p> <h5><strong><u>البند الرابع (المستندات المطلوبة)</u></strong></h5> <ol> <li>يلتزم متلقي الخدمة بأرسال صورة ضوئية حديثة وسارية من السجل التجاري والبطاقة الضريبية ورقم الحساب البنكي المعتمد او رقم محفظة وسيلة الدفع للمنصة فى موعد اقصاة 72 ساعة من التسجيل بالمنصة والتطبيق ويرسل على ايميل .................... </li> <li>يلتزم مقدم الخدمة بأرسال صورة سارية من الرقم القومي وما يفيد ملكيتة للمحفظة التي سيتم التعامل من خلالها</li> </ol> <h5><strong><u>البند الخامس &nbsp;(</u></strong><strong><u>حظر الحسابات)</u></strong></h5> <p>يحق لمنصة وتطبيق ميدتيك حظر &nbsp;الحسابات المخالفة لشروط الموقع وذلك في حالة مخالفتها للشروط .</p> <h5><strong><u>البند السادس &nbsp;(العمولات والمصاريف)</u></strong></h5> <ol> <li>بالنسبة لمتلقي الخدمة لاتقوم منصة ميدتيك بخصم اية عمولات من متلقي الخدمة</li> <li>يستحق على متلقي الخدمة ان يكون المبلغ المودع في حساب العملية ( المشروع بالصافي ) بحيث يضاف الى مبلغ العملية قيمة 2% تسدد كرسوم تحويل دون الحصول على عمولة</li> <li>بالنسبة لمقدم الخدمة يتم اقتطاع عمولة منصة وتطبيق ميدتيك من مقدم الخدمة وهي نسبة 20% من قيمة العملية ( المشروع ) </li> </ol> <h5><strong><u>البند السابع (ضريبة القيمة المضافة)</u></strong></h5> <p>وهي ضريبة تفرض بواقع 14% على متلقي الخدمة طبقا لاحكام القانون 67 لسنة 2016 وتعديلاتة</p> <p>مثال لمتلقي الخدمة</p> <ol> <li>متلقي الخدمة قيمة المشروع الجاري تنفيذة 1000 جنية ( فقط الف جنيها مصريا لا غير )</li> </ol> <p>اذا ما سوف يقوم متلقي الخدمة بأيداعة هو مبلغ 1168 جنية مصريا او ما يعادلة بالعملات الاخرى في تاريخ التحويل طبقا لاسعار البنك المركزي المصري ولتوضيح الامر يكون تحليل المبلغ عبارة عن</p> <p>1000 جنية مصري قيمة تنفيذ العملية</p> <p>140 جنية مصري ضريبة القيمة المضافة</p> <p>28 جنية مصري مصروفات الايداع بواقع 2%</p> <ol start="2"> <li>مقدم الخدمة سيتم الحصول على قيمة المشروع بالشكل التالي</li> </ol> <p><strong>الحالة الاولي مشروع لا يحتاج لضمان اعمال </strong></p> <p>على نفس المثال السابق سيتم توريد قيمة العملية مخصوما منها عمولة ميدتيك ليكون المبلغ المحول هو 800 جنية مصريا لاغير </p> <p><strong>الحالة الثانية مشروع به قطع غيار ويحتاج لضمان اعمال </strong></p> <ol> <li>يستحق عند استلام المشروع مبلغ 720 جنية مصريا لاغير بعد خصم محجوز ضمان الاعمال الابتدائي والنهائي</li> <li>يسدد 5% محجون ضمان الاعمال الابتدائي بقيمة 40 جنية مصريا بعد 30 يوم من تاريخ تسليم المشروع</li> <li>يسدد 5% محجوز ضمان الاعمال النهائي بقيمة 40 جنية مصريا بعد 90 يوم من تاريخ تسليم المشروع وتوريد شهادة الضمان</li> </ol> <h5><strong><u>البند الثامن &nbsp;(الفواتير وكشوف الحساب)</u></strong></h5> <p>يتم ارسال ارسال الفاتورة الضريبة الاليكترونية طبقا لقرار رئيس مصلحة الضرائب في نفس يوم تسليم المشروع مع احقية متلقي الخدمة في خصم 3% تحت حساب الضريبة وتوريد اشعار بها ما لم تقدم منصة وتطبيق ميدتيك ما يفيد بخصوعها لنظام الدفعات المقدمة </p> <p>يحق لمتلقي الخدمة طلب كشف حساب بالتعامل سواء شهري او ربع سنوي او سنوي او المصادقة على الحساب&nbsp; &nbsp;</p> <h5><strong><u>البند التاسع (إيقاف الحسابات)</u></strong></h5> <ul> <li>استخدام مقدم الخدمة &nbsp;وسيلة دفع مسروقة أو غير مملوكة من قبله</li> <li>استخدام الحساب من قبل أكثر من شخص سواء كانوا فريقا أم شركة، حيث يسمح فقط لشخص واحد باستخدام الحساب في منصة وتطبيق ميدتيك &nbsp;والعمل على المشاريع فيه</li> <li>قيام مقدم الخدمة &nbsp;بلعب دور الوسيط في المشاريع</li> <li>حصول متلقي الخدمة على 5 مشروعات متتالية بتقييم سيء</li> <li>تأكد منصة وتطبيق ميدتيك من تواصلة المباشر مع متلقي الخدمة للتهرب من دفع عمولة ميدتيك ويحق للمنصة والتطبيق حظر مقدم الخدمة نهائيا</li> <li>استخدام مقدم الخدمة اسم يتنافى مع الاداب العامة ويظهر مقدم الخدمة بصورة غير احترافية</li> </ul> <h5><strong><u>البند </u></strong><strong><u>العاشر </u></strong><strong><u>&nbsp;</u></strong><strong><u>(استلام المشروع) </u></strong></h5> <p>بأستلام متلقي الخدمة المشروع وانهائة يحق لشركة المبرمجون العرب لتقنية المعلومات ( ملكة العلامة التجارية لتطبيق ومنصة ميدتيك ) تسليم مستحقات الاطراف من وقت انهاء واستلام المشروع بما لا يتعارض مع البند السابع الحالة الثانية</p> <h5><strong><u>البند&nbsp; الحادي عشر (تحديث الشروط والاحكام)</u></strong></h5> <p>يحق لمنصة وتطبيق ميدتيك دون غيرها تحديث وتطوير واضافة شروط اخري او تقييد بعض البنود بما تراه يحافظ على حقوق الاطراف على ان يتم اخطار كلا من متلقي ومقدم الخدمة بهذة التحديثات</p> </div>';
  },
};
